tutorials/N2.jet.LES/c4.PR/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver            EulerImplicit;
    //method            idKineticStandard;
    //method            SRKchungKineticStandard;
    //method            SRKchungTakaStandard;
    method            PRchungTakaStandard;
    //method            PRchungKineticStandard;
}

//chemistry           on;
chemistry           off;

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          Rosenbrock43;
    absTol          1e-8;
    relTol          0.01;
}

#include "reactions"

// ************************************************************************* //
