tutorials/N2.jet.LES/c4.PR/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

//internalField   uniform 1.01325e5;  //1  atm
//internalField   uniform 1.0e5;  //1  bar
internalField   uniform 39.7e5;  //39.7  bar

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
//        type            zeroGradient;
        type            totalPressure;
        p0              $internalField;
    }
  
    frontWall
    {
        type            zeroGradient;
    }
    
    outerWall
    {   
        type            zeroGradient;
    }
}


// ************************************************************************* //
